NineNinecats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2021-03-28"], ["name", "Bob"], ["sex", ""], ["description", "       A nice cat "], ["created_at", "2021-04-02 20:42:25.997504"], ["updated_at", "2021-04-02 20:42:25.997504"]]

    def update
        cat = Cat.find(params[:id])
        if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "Blue"], ["sex", "M"], ["description", "        sdfasdf"], ["updated_at", "2021-04-02 21:24:57.359125"], ["id", 1]]